#include <stdio.h>

int main() {
int i = 1;
do {
if (i == 6) {
i++; // เพิ่มค่า i ก่อน ไม่งั้นค้าง
continue;
}
printf("%d ", i);
i++;
} while (i <= 10);
return 0;
}
/*
1.เริ่มต้น i = 1

2.เข้าไปทำงานในบล็อก do { ... } ก่อน อย่างน้อย 1 ครั้ง

3.ถ้า i == 6 → เพิ่มค่า i++ แล้ว continue (กระโดดไปเช็กเงื่อนไข while)

4.ถ้าไม่ใช่ 6 → พิมพ์ค่า i แล้วค่อย i++

5.เช็กเงื่อนไข (i <= 10) ถ้ายังจริง → ทำซ้ำ

6.จบลูปเมื่อ i > 10

สรุปผลการทดลอง 
ทั้ง 3 วิธีได้ผลลัพธ์เท่ากัน
for โค้ดกระชับ อ่านง่าย
while ยืดหยุ่น ใช้บ่อย
do while รับประกกันว่าทำงานอย่างน้อย 1ครั้ง
*/